swak4foam/Examples/FromPresentations/OFW8_landspeedersInCanyon/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    //- Set patchGroups for constraint patches
    #include "${WM_PROJECT_DIR}/etc/caseDicts/setConstraintTypes"

    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           $internalField;
    }

    "canyon.+"
    {
        type            zeroGradient;
    }

    "landSpeeder.+_main_.+"
    {
        type            zeroGradient;
    }

    "landSpeeder.+Jet_inlet"
    {
        type zeroGradient;
    }

    "landSpeeder.+Jet_outlet"
    {
        type zeroGradient;
    }

    "landSpeeder.+Jet_(hull|mount)"
    {
        type zeroGradient;
    }

    sky {
        type slip;
    }
}

// ************************************************************************* //
